<a href="https://colab.research.google.com/github/sangjin94/SQL_ITWILL/blob/main/da17_categorical.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Categorical Data

In [2]:
import numpy as np
import pandas as pd

In [3]:
movie_rating = pd.DataFrame({'user_id':np.arange(1,1_000_001),
                             'gender':['M']*500_000+['F']*500_000,
                             'rating': np.random.randint(1,6,size=1000000)})

In [6]:
movie_rating.info()
#> gender 컬럼의 타입은 object(문자열)
#> rating 컬럼의 타입은 int64(정수)
#> memory usage: 22.9+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   user_id  1000000 non-null  int64
 1   gender   1000000 non-null  object
 2   rating   1000000 non-null  int64
dtypes: int64(2), object(1)
memory usage: 22.9+ MB

In [9]:
movie_rating['gender'].value_counts()

M    500000
F    500000
Name: gender, dtype: int64

In [10]:
movie_rating['rating'].value_counts()

1    200600
3    200071
2    199938
5    199803
4    199588
Name: rating, dtype: int64

In [12]:
# gender 컬럼의 타입 object에서 category 타입으로 변환
movie_rating['gender']=movie_rating['gender'].astype('category')

In [14]:
movie_rating.info()
#> memory usage: 16.2 MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   user_id  1000000 non-null  int64
 1   gender   1000000 non-null  category
 2   rating   1000000 non-null  int64
dtypes: category(1), int64(2)
memory usage: 16.2 MB

In [15]:
# rating 컬럼의 타입 int64에서 category 타입으로 변환
movie_rating['rating']=movie_rating['rating'].astype('category')

In [16]:
movie_rating.info()
#> memory usage: 9.5 MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   user_id  1000000 non-null  int64
 1   gender   1000000 non-null  category
 2   rating   1000000 non-null  category
dtypes: category(2), int64(1)
memory usage: 9.5 MB

In [17]:
movie_rating

        user_id gender rating
0             1      M      5
1             2      M      5
2             3      M      2
3             4      M      4
4             5      M      4
...         ...    ...    ...
999995   999996      F      1
999996   999997      F      2
999997   999998      F      3
999998   999999      F      1
999999  1000000      F      2

[1000000 rows x 3 columns]

# 연속형 변수를 카테고리 타입으로 변환

In [23]:
df= pd.DataFrame({'id':np.arange(1,11),'age':np.random.randint(10,90,size=10)})

In [24]:
df

   id  age
0   1   66
1   2   71
2   3   26
3   4   10
4   5   20
5   6   30
6   7   73
7   8   42
8   9   14
9  10   24

In [35]:
df['ages']=pd.cut(x=df['age'],bins=np.arange(10,100,10),right=False)
# bins:구간의 경계값들로 이루어진 배열
# right: 구간의 오른쪽 경계를 포함할 지 말지 결정. 기본값은 True ( 왼쪽은 포함안됨 . False는 반대)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   age     10 non-null     int64
 2   ages    10 non-null     category
dtypes: category(1), int64(2)
memory usage: 746.0 bytes

In [38]:
df.groupby('ages').size() # df['ages'],value_counts()

ages
[10, 20)    2
[20, 30)    3
[30, 40)    1
[40, 50)    1
[50, 60)    0
[60, 70)    1
[70, 80)    2
[80, 90)    0
dtype: int64

pd.cut() 함수에서 bins 파라미터의 구간 경계값들은 일정한 간격일 필요는 없다.

In [40]:
df['age_level']=pd.cut(x=df['age'],bins=[0,20,60,100],labels=['young','middle','old'])
#> bins: 구간의 경계값들로 이루어진 배열(리스트)
#> labels: 구간의 레이블(이름)
df

   id  age      ages age_level
0   1   66  [60, 70)       old
1   2   71  [70, 80)       old
2   3   26  [20, 30)    middle
3   4   10  [10, 20)     young
4   5   20  [20, 30)     young
5   6   30  [30, 40)    middle
6   7   73  [70, 80)       old
7   8   42  [40, 50)    middle
8   9   14  [10, 20)     young
9  10   24  [20, 30)    middle